app/controllers/projects_controller.rb

  def create
    #first_version_name = params[:version][:first_version_name]
#TEMPORARY - CHANGE
    first_version_name = "default"
#    session[:project].delete(:first_version_name)

    params[:project][:user_id] = session[:user]

    if first_version_name
      @project = Project.new(params[:project])

      if @project.save
        @version = Version.new({:name => first_version_name,
                              :user_id => session[:user],
                              :project_id => @project.id })

        PicusNotificator.deliver_project_created(@project)
        @version.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id", "description") VALUES(E'Bubble', '2010-04-26 09:35:58.917745', '2010-04-26 09:35:58.917745', NULL, E'Fubble') RETURNING "id"
INSERT INTO "versions" ("name", "created_at", "project_id", "updated_at", "user_id") VALUES(E'default', '2010-04-26 09:35:59.021137', 2, '2010-04-26 09:35:59.021137', NULL) RETURNING "id"

  def destroy
    @project = Project.find_by_id(params[:id])
    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = E'12') LIMIT 1
DELETE FROM "projects" WHERE "id" = 12