app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY username
---
  def index
    @users = User.all